backend/app/controllers/games_controller.rb

  def create
    @game = Game.new(game_params)

    respond_to do |format|
      if @game.save
---
INSERT INTO "games" ("user", "day", "event", "energy", "pet", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["user", ""], ["day", 1], ["event", 1], ["energy", 5], ["pet", nil], ["created_at", "2023-11-30 22:29:55.863377"], ["updated_at", "2023-11-30 22:29:55.863377"]]