backend/app/controllers/pets_controller.rb

INSERT INTO "pets" ("species", "name", "mood", "treat", "play", "talk", "to_pet", "created_at", "updated_at", "pet_happy", "pet_sad", "pet_neutral", "game_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13) RETURNING "id"
---
  def create
    @pet = Pet.new(pet_params)

    respond_to do |format|
      if @pet.save